### Lab 01 - Assignment - By - Vinay S

### Q1

### Load Required Libraries

In [50]:
import mysql.connector
import pandas as pd
from streamlit import columns

### Connect to DB using Mysql-connector-python package

In [51]:
# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    #database='e_commerce' # e.g., 'test_db'
)

In [52]:
db_name = 'e_commerce'

In [53]:
#############
# Drop the DB

myquery = f"""DROP DATABASE IF EXISTS {db_name};"""

In [54]:
cursor = connection.cursor()

In [55]:
cursor.execute(myquery)

In [56]:
connection.commit()
cursor.close()

True

In [57]:
connection.close()

In [58]:
# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    #database='e_commerce' # e.g., 'test_db'
)

In [59]:
db_name = 'e_commerce'

In [60]:
myquery = f"""CREATE DATABASE IF NOT EXISTS {db_name}"""

In [61]:
cursor = connection.cursor()
cursor.execute(myquery)

In [62]:
connection.commit()
cursor.close()

True

In [63]:
connection.close()

In [64]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [65]:
myquery = """
    CREATE TABLE supplier (
        SUPP_ID INT PRIMARY KEY,
        SUPP_NAME VARCHAR(50),
        SUPP_CITY VARCHAR(50),
        SUPP_PHONE VARCHAR(10)
    );
    
    CREATE TABLE customer (
        CUS_ID INT NOT NULL,
        CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
        CUS_PHONE VARCHAR(10),
        CUS_CITY VARCHAR(30),
        CUS_GENDER CHAR,
        PRIMARY KEY (CUS_ID)
    );
    
    CREATE TABLE category (
        CAT_ID INT NOT NULL,
        CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
        PRIMARY KEY (CAT_ID)
    );
    
    CREATE TABLE product (
        PRO_ID INT NOT NULL,
        PRO_NAME VARCHAR(20) NULL DEFAULT NULL,
        PRO_DESC VARCHAR(60) NULL DEFAULT NULL,
        CAT_ID INT NOT NULL,
        PRIMARY KEY (PRO_ID),
        FOREIGN KEY (CAT_ID) REFERENCES category (CAT_ID)
    );
    
    CREATE TABLE product_details (
        PROD_ID INT NOT NULL,
        PRO_ID INT NOT NULL,
        SUPP_ID INT NOT NULL,
        PROD_PRICE INT NOT NULL,
        PRIMARY KEY (PROD_ID),
        FOREIGN KEY (PRO_ID) REFERENCES product (PRO_ID),
        FOREIGN KEY (SUPP_ID) REFERENCES supplier (SUPP_ID)
    );
    
    CREATE TABLE orders (
        ORD_ID INT NOT NULL,
        ORD_AMOUNT INT NOT NULL,
        ORD_DATE DATE,
        CUS_ID INT NOT NULL,
        PROD_ID INT NOT NULL,
        PRIMARY KEY (ORD_ID),
        FOREIGN KEY (CUS_ID) REFERENCES customer (CUS_ID),
        FOREIGN KEY (PROD_ID) REFERENCES product_details (PROD_ID)
    );
    
    CREATE TABLE rating (
        RAT_ID INT NOT NULL,
        CUS_ID INT NOT NULL,
        SUPP_ID INT NOT NULL,
        RAT_RATSTARS INT NOT NULL,
        PRIMARY KEY (RAT_ID),
        FOREIGN KEY (SUPP_ID) REFERENCES supplier (SUPP_ID),
        FOREIGN KEY (CUS_ID) REFERENCES customer (CUS_ID)
    );
"""

In [66]:
cursor = connection.cursor()

In [67]:
cursor.execute(myquery)

In [69]:
#connection.commit()
cursor.close()
connection.close()

### Q2

In [ ]:
### Inserting Values into Supplier Table

In [72]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [73]:
myquery = """
INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES
(1, 'Rajesh Retails', 'Delhi', '1234567890'),
(2, 'Appario Ltd.', 'Mumbai', '258963147032'),
(3, 'Knome products', 'Bangalore', '9785462315'),
(4, 'Bansal Retails', 'Kochi', '8975463285'),
(5, 'Mittal Ltd.', 'Lucknow', '7898456532');
"""

In [74]:
cursor = connection.cursor()

In [75]:
cursor.execute(myquery)
connection.commit()

In [76]:
cursor.close()
connection.close()

In [ ]:
### Inserting Values into Customer Table

In [77]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [86]:
myquery = """
INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES
(1, 'AAKASH', 9999999999, 'DELHI', 'M'),
(2, 'AMAN', 9785463215, 'NOIDA', 'M'),
(3, 'NEHA', 9999999998, 'MUMBAI', 'F'),
(4, 'MEGHA', 9994562399, 'KOLKATA', 'F'),
(5, 'PULKIT', 7895999999, 'LUCKNOW', 'M');
"""

In [87]:
cursor = connection.cursor()

In [88]:
cursor.execute(myquery)
connection.commit()

In [89]:
cursor.close()
connection.close()

In [ ]:
### Inserting Values into Category Table

In [90]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [91]:
myquery = """
INSERT INTO category (CAT_ID, CAT_NAME) VALUES
(1, 'BOOKS'),
(2, 'GAMES'),
(3, 'GROCERIES'),
(4, 'ELECTRONICS'),
(5, 'CLOTHES');
"""

In [92]:
cursor = connection.cursor()

In [93]:
cursor.execute(myquery)
connection.commit()

In [94]:
cursor.close()
connection.close()

In [ ]:
### Inserting Values into Product Table

In [95]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [96]:
myquery = """
INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES
(1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2),
(2, 'TSHIRT', 'DFDFJDFJDKFD', 5),
(3, 'ROG LAPTOP', 'DFNTTNTNTERND', 4),
(4, 'OATS', 'REURENTBTOTH', 3),
(5, 'HARRY POTTER', 'NBEMCTHTJTH', 1);
"""

In [98]:
cursor = connection.cursor()

In [99]:
cursor.execute(myquery)
connection.commit()

In [100]:
cursor.close()
connection.close()

In [ ]:
### Inserting Values into Product_Details Table

In [101]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [103]:
myquery="""
INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES
(1, 1, 2, 1500),
(2, 3, 5, 30000),
(3, 5, 1, 3000),
(4, 2, 3, 2500),
(5, 4, 1, 1000);
"""

In [104]:
cursor = connection.cursor()

In [105]:
cursor.execute(myquery)
connection.commit()

In [106]:
cursor.close()
connection.close()

In [ ]:
### Inserting Values into Orders Table

In [107]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [108]:
myquery = """
INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES
(20, 1500, '2021-10-12', 3, 5),
(25, 30500, '2021-09-16', 5, 2),
(26, 2000, '2021-10-05', 1, 1),
(30, 3500, '2021-08-16', 4, 3),
(50, 2000, '2021-10-06', 2, 1);
"""

In [111]:
cursor = connection.cursor()

In [112]:
cursor.execute(myquery)
connection.commit()

In [113]:
cursor.close()
connection.close()

In [ ]:
### Inserting Values into Rating Table

In [114]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [115]:
myquery = """
INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES
(1, 2, 2, 4),
(2, 3, 4, 3),
(3, 5, 1, 5),
(4, 1, 3, 2),
(5, 4, 5, 4);
"""

In [117]:
cursor = connection.cursor()

In [118]:
cursor.execute(myquery)
connection.commit()

In [119]:
cursor.close()
connection.close()

### Q3

In [ ]:
### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000

In [120]:
db_name = 'e_commerce'

# Establish a connection to the database
connection = mysql.connector.connect(
    host='localhost',        # e.g., 'localhost'
    user='root',    # e.g., 'root'
    password='',# e.g., 'password'
    database=db_name # e.g., 'test_db'
)

In [121]:
myquery = """
SELECT CUS_GENDER, COUNT(*) AS num_customers
FROM customer
JOIN orders ON customer.CUS_ID = orders.CUS_ID
WHERE ORD_AMOUNT >= 3000
GROUP BY CUS_GENDER;
"""

In [122]:
cursor = connection.cursor()

In [123]:
cursor.execute(myquery)

In [124]:
output = cursor.fetchall()

In [127]:
df = pd.DataFrame(output, columns=['CUS_GENDER', 'num_customers'])

In [128]:
df.head()

  CUS_GENDER  num_customers
0          F              1
1          M              1

### Q4

In [ ]:
### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [130]:
myquery = """
SELECT orders.ORD_ID, orders.ORD_AMOUNT, orders.ORD_DATE, product.PRO_NAME
FROM orders
JOIN product_details ON orders.PROD_ID = product_details.PROD_ID
JOIN product ON product_details.PRO_ID = product.PRO_ID
WHERE orders.CUS_ID = 2;
"""

In [131]:
cursor = connection.cursor()
cursor.execute(myquery)

In [132]:
output = cursor.fetchall()
print(output)

[(50, 2000, datetime.date(2021, 10, 6), 'GTA V')]

In [134]:
df = pd.DataFrame(output, columns=['orders.ORD_ID', 'orders.ORD_AMOUNT', 'orders.ORD_DATE', 'product.PRO_NAME'])

df.head()

   orders.ORD_ID  orders.ORD_AMOUNT orders.ORD_DATE product.PRO_NAME
0             50               2000      2021-10-06            GTA V

In [135]:
### Alternative Query as provided by Faculty
myquery = """
select `orders`.*, product.pro_name 
from `orders` ,product_details,product 
where `orders`.cus_id=2 and `orders`.prod_id=product_details.prod_id and product_details.pro_id=product.pro_id;
"""

In [136]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [137]:
print(output)

[(50, 2000, datetime.date(2021, 10, 6), 2, 1, 'GTA V')]

In [139]:
df = pd.DataFrame(output, columns=['orders.ORD_ID', 'orders.ORD_AMOUNT', 'orders.ORD_DATE', "product.cust_id", 'product.prod_id', 'product.pro_name'])
df.head()

,orders.ORD_ID,orders.ORD_AMOUNT,orders.ORD_DATE,product.cust_id,product.prod_id,product.pro_name
0,50,2000,2021-10-06,2,1,GTA V

### Q5

In [ ]:
### Q5) Display the Supplier details who can supply more than one product.

In [140]:
myquery = """
SELECT SUPP_ID, SUPP_NAME
FROM supplier
WHERE SUPP_ID IN (
    SELECT SUPP_ID
    FROM product_details
    GROUP BY SUPP_ID
    HAVING COUNT(*) > 1
);
"""

In [141]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [143]:
print(output)

[(1, 'Rajesh Retails')]

In [144]:
df = pd.DataFrame(output, columns=['SUPP_ID', 'SUPP_NAME'])
df.head()

   SUPP_ID       SUPP_NAME
0        1  Rajesh Retails

In [145]:
# Alternative Query provided by the Faculty
myquery = """
select supplier.* 
from supplier,product_details 
where supplier.supp_id in 
(select product_details.supp_id from product_details 
group by product_details.supp_id having count(product_details.supp_id)>1) 
group by supplier.supp_id;
"""

In [146]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [147]:
print(output)

[(1, 'Rajesh Retails', 'Delhi', '1234567890')]

In [148]:
df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6

In [ ]:
### Q6) Find the category of the product whose order amount is minimum.

In [149]:
myquery = """
SELECT category.CAT_NAME
FROM category
JOIN product ON category.CAT_ID = product.CAT_ID
JOIN product_details ON product.PRO_ID = product_details.PRO_ID
JOIN orders ON product_details.PROD_ID = orders.PROD_ID
WHERE orders.ORD_AMOUNT = (
    SELECT MIN(ORD_AMOUNT)
    FROM orders
);
"""

In [150]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [151]:
print(output)

[('GROCERIES',)]

In [152]:
df = pd.DataFrame(output, columns=['category.CAT_NAME'])
df.head()

  category.CAT_NAME
0         GROCERIES

In [153]:
# Alternative Query Provided by the Faculty
myquery = """
SELECT category.cat_id, category.cat_name, MIN(orders.ord_amount) AS min_order_amount
FROM orders 
INNER JOIN product_details ON orders.prod_id = product_details.prod_id 
INNER JOIN product ON product.pro_id = product_details.pro_id 
INNER JOIN category ON category.cat_id = product.cat_id 
GROUP BY category.cat_id, category.cat_name;
"""

In [154]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [155]:
print(output)

[(1, 'BOOKS', 3500), (2, 'GAMES', 2000), (3, 'GROCERIES', 1500), (4, 'ELECTRONICS', 30500)]

In [156]:
# Another Query from Faculty
myquery = """
select category.* 
from `orders` inner join product_details on `orders`.prod_id=product_details.prod_id 
inner join product on product.pro_id=product_details.pro_id 
inner join category on category.cat_id=product.cat_id having min(`orders`.ord_amount);
"""

In [157]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [158]:
print(output)

[(3, 'GROCERIES')]

In [160]:
df = pd.DataFrame(output, columns=['category.cat_id','category.cat_name'])

In [161]:
df.head()

   category.cat_id category.cat_name
0                3         GROCERIES

### Q7

In [ ]:
### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [162]:
myquery = """
SELECT product.PRO_ID, product.PRO_NAME
FROM product
JOIN product_details ON product.PRO_ID = product_details.PRO_ID
JOIN orders ON product_details.PROD_ID = orders.PROD_ID
WHERE orders.ORD_DATE > '2021-10-05';
"""

In [163]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [164]:
print(output)

[(4, 'OATS'), (1, 'GTA V')]

In [165]:
df = pd.DataFrame(output, columns=['product.PRO_ID','product.PRO_NAME'])
df.head()

   product.PRO_ID product.PRO_NAME
0               4             OATS
1               1            GTA V

### Q8

In [ ]:
### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [166]:
myquery = """
SELECT supplier.SUPP_ID, supplier.SUPP_NAME, AVG(rating.RAT_RATSTARS) AS avg_rating, customer.CUS_NAME
FROM supplier
JOIN rating ON supplier.SUPP_ID = rating.SUPP_ID
JOIN customer ON rating.CUS_ID = customer.CUS_ID
GROUP BY supplier.SUPP_ID, supplier.SUPP_NAME
ORDER BY avg_rating DESC
LIMIT 3;
"""

In [167]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [168]:
print(output)

[(1, 'Rajesh Retails', Decimal('5.0000'), 'PULKIT'), (5, 'Mittal Ltd.', Decimal('4.0000'), 'MEGHA'), (2, 'Appario Ltd.', Decimal('4.0000'), 'AMAN')]

In [169]:
df = pd.DataFrame(output, columns=['SUPPLIER_ID', 'SUPPLIER_NAME', 'AVG_Rating', 'CUSTOMER_NAME'])
df

   SUPPLIER_ID   SUPPLIER_NAME AVG_Rating CUSTOMER_NAME
0            1  Rajesh Retails     5.0000        PULKIT
1            5     Mittal Ltd.     4.0000         MEGHA
2            2    Appario Ltd.     4.0000          AMAN

In [170]:
# Alternative Query as provided by Faculty
myquery = """
select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars 
from rating inner join supplier on rating.supp_id=supplier.supp_id 
inner join customer on rating.cus_id=customer.cus_id order by rating.rat_ratstars desc limit 3;
"""

In [171]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [172]:
print(output)

[(1, 'Rajesh Retails', 'PULKIT', 5), (2, 'Appario Ltd.', 'AMAN', 4), (5, 'Mittal Ltd.', 'MEGHA', 4)]

In [173]:
df = pd.DataFrame(output, columns=['Supplier_ID', 'Supplier_Name', 'CUS_NAME', 'Rating'])
df.head()

   Supplier_ID   Supplier_Name CUS_NAME  Rating
0            1  Rajesh Retails   PULKIT       5
1            2    Appario Ltd.     AMAN       4
2            5     Mittal Ltd.    MEGHA       4

### Q9

In [174]:
myquery = """
SELECT CUS_NAME, CUS_GENDER
FROM customer
WHERE CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A';
"""

In [175]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [176]:
print(output)

[('AAKASH', 'M'), ('AMAN', 'M'), ('NEHA', 'F'), ('MEGHA', 'F')]

In [177]:
df = pd.DataFrame(output, columns=['CUS_NAME', 'CUS_GENDER'])
df.head()

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

### Q10

In [ ]:
### Q10) Display the total order amount of the male customers

In [178]:
myquery = """
SELECT SUM(orders.ORD_AMOUNT) AS total_order_amount
FROM orders
JOIN customer ON orders.CUS_ID = customer.CUS_ID
WHERE customer.CUS_GENDER = 'M';
"""

In [179]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [180]:
print(output)

[(Decimal('34500'),)]

In [181]:
df = pd.DataFrame(output, columns=['Amount'])
df.head()

  Amount
0  34500

### Q11

In [ ]:
### Q11) Display all the Customers left outer join with  the orders

In [182]:
myquery = """
SELECT 
customer.CUS_ID, customer.CUS_NAME, customer.CUS_PHONE, customer.CUS_CITY, customer.CUS_GENDER, orders.ORD_ID, orders.ORD_AMOUNT, orders.ORD_DATE
FROM customer
LEFT JOIN orders ON customer.CUS_ID = orders.CUS_ID;
"""

In [183]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [184]:
print(output)

[(3, 'NEHA', '9999999998', 'MUMBAI', 'F', 20, 1500, datetime.date(2021, 10, 12)), (5, 'PULKIT', '7895999999', 'LUCKNOW', 'M', 25, 30500, datetime.date(2021, 9, 16)), (1, 'AAKASH', '9999999999', 'DELHI', 'M', 26, 2000, datetime.date(2021, 10, 5)), (4, 'MEGHA', '9994562399', 'KOLKATA', 'F', 30, 3500, datetime.date(2021, 8, 16)), (2, 'AMAN', '9785463215', 'NOIDA', 'M', 50, 2000, datetime.date(2021, 10, 6))]

In [185]:
df = pd.DataFrame(output, columns=['CUST_ID', 'CUST_NAME', 'PHONE', 'CITY', 'GENDER', 'ORD_ID', 'AMOUNT', 'ORD_DATE'])
df

   CUST_ID CUST_NAME       PHONE     CITY GENDER  ORD_ID  AMOUNT    ORD_DATE
0        3      NEHA  9999999998   MUMBAI      F      20    1500  2021-10-12
1        5    PULKIT  7895999999  LUCKNOW      M      25   30500  2021-09-16
2        1    AAKASH  9999999999    DELHI      M      26    2000  2021-10-05
3        4     MEGHA  9994562399  KOLKATA      F      30    3500  2021-08-16
4        2      AMAN  9785463215    NOIDA      M      50    2000  2021-10-06

In [ ]:
# Alternative Query as provided by Faculty

In [186]:
myquery = """
select *  from customer left outer join `orders` on customer.cus_id=`orders`.cus_id;
"""

In [187]:
cursor = connection.cursor()
cursor.execute(myquery)
output = cursor.fetchall()

In [188]:
print(output)

[(3, 'NEHA', '9999999998', 'MUMBAI', 'F', 20, 1500, datetime.date(2021, 10, 12), 3, 5), (5, 'PULKIT', '7895999999', 'LUCKNOW', 'M', 25, 30500, datetime.date(2021, 9, 16), 5, 2), (1, 'AAKASH', '9999999999', 'DELHI', 'M', 26, 2000, datetime.date(2021, 10, 5), 1, 1), (4, 'MEGHA', '9994562399', 'KOLKATA', 'F', 30, 3500, datetime.date(2021, 8, 16), 4, 3), (2, 'AMAN', '9785463215', 'NOIDA', 'M', 50, 2000, datetime.date(2021, 10, 6), 2, 1)]

In [189]:
df = pd.DataFrame(output, columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER','ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID'])
df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
1,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2
2,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1

In [190]:
cursor.close()
connection.close()

### Lab-01 - Assignment - Concluded